In [80]:
!pip install findspark

Requirement already satisfied: findspark in ./opt/anaconda3/envs/py310/lib/python3.10/site-packages (2.0.1)

In [1]:
import pyspark

In [2]:
from pyspark.sql import SparkSession

spark = SparkSession.builder.appName("MyApp").getOrCreate()

# Now you can use Spark to process data

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

23/04/13 16:33:01 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [4]:
spark

In [15]:
# df = spark.read.csv("/Users/komal/Desktop/titanic_train.csv)
df = spark.read.csv("/Users/komal/Desktop/titanic_train.csv")

In [17]:
# it show type of all columns like  type() does in pandas
df

DataFrame[_c0: string, _c1: string, _c2: string, _c3: string, _c4: string, _c5: string, _c6: string, _c7: string, _c8: string, _c9: string, _c10: string, _c11: string, _c12: string, _c13: string, _c14: string]

In [18]:
#show() does same like info()
df.show()

+------------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----+-----+--------------------+--------+
|         _c0|   _c1|                 _c2|   _c3| _c4|  _c5|  _c6|      _c7|    _c8|  _c9|    _c10|_c11| _c12|                _c13|    _c14|
+------------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----+-----+--------------------+--------+
|passenger_id|pclass|                name|   sex| age|sibsp|parch|   ticket|   fare|cabin|embarked|boat| body|           home.dest|survived|
|        1216|     3|  Smyth, Miss. Julia|female|null|    0|    0|   335432| 7.7333| null|       Q|  13| null|                null|       1|
|         699|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0|   315089| 8.6625| null|       S|null| null|             Croatia|       0|
|        1267|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|   345773|  24.15| null|       S|null| null|                null|       0|
|         449|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3|    29105|   23.0| null|       S|   4| null|Cornwall / Akron, OH|       1|
|         576|     2|     Veal, Mr. James|  male|40.0|    0|    0|    28221|   13.0| null|       S|null| null|Barre, Co Washing...|       0|
|        1083|     3|Olsen, Mr. Henry ...|  male|28.0|    0|    0|   C 4001| 22.525| null|       S|null|173.0|                null|       0|
|         898|     3|Johnson, Mr. Will...|  male|19.0|    0|    0|     LINE|    0.0| null|       S|null| null|                null|       0|
|         560|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|   250648|   13.0| null|       S|  10| null|Finland / Washing...|       1|
|        1079|     3|  Ohman, Miss. Velin|female|22.0|    0|    0|   347085|  7.775| null|       S|   C| null|                null|       1|
|         908|     3|Jussila, Miss. Ma...|female|21.0|    1|    0|     4137|  9.825| null|       S|null| null|                null|       0|
|         313|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|   113503|  211.5|  C82|       C|null| null|     Elkins Park, PA|       0|
|          43|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|    11813|76.2917|  D15|       C|   8| null|    Philadelphia, PA|       1|
|         233|     1|Potter, Mrs. Thom...|female|56.0|    0|    1|    11767|83.1583|  C50|       C|   7| null|Mt Airy, Philadel...|       1|
|         446|     2|"Hocking, Miss. E...|female|20.0|    2|    1|    29105|   23.0| null|       S|   4| null|Cornwall / Akron, OH|       1|
|         602|     3|Abbott, Mr. Rossm...|  male|16.0|    1|    1|C.A. 2673|  20.25| null|       S|null|190.0| East Providence, RI|       0|
|         884|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0|   350047| 7.8542| null|       S|null| null|                null|       0|
|         497|     2|Maybery, Mr. Fran...|  male|40.0|    0|    0|   239059|   16.0| null|       S|null| null|Weston-Super-Mare...|       0|
|        1003|     3|  McCoy, Mr. Bernard|  male|null|    2|    0|   367226|  23.25| null|       Q|  16| null|                null|       1|
|          36|     1|Bowerman, Miss. E...|female|22.0|    0|    1|   113505|   55.0|  E33|       S|   6| null|St Leonards-on-Se...|       1|
+------------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----+-----+--------------------+--------+
only showing top 20 rows

In [25]:
# want to check data with header
df =spark.read.option('header', 'true').csv("/Users/komal/Desktop/titanic_train.csv")
spark.read.option('header', 'true').csv("/Users/komal/Desktop/titanic_train.csv").show()

+------------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----+-----+--------------------+--------+
|passenger_id|pclass|                name|   sex| age|sibsp|parch|   ticket|   fare|cabin|embarked|boat| body|           home.dest|survived|
+------------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----+-----+--------------------+--------+
|        1216|     3|  Smyth, Miss. Julia|female|null|    0|    0|   335432| 7.7333| null|       Q|  13| null|                null|       1|
|         699|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0|   315089| 8.6625| null|       S|null| null|             Croatia|       0|
|        1267|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|   345773|  24.15| null|       S|null| null|                null|       0|
|         449|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3|    29105|   23.0| null|       S|   4| null|Cornwall / Akron, OH|       1|
|         576|     2|     Veal, Mr. James|  male|40.0|    0|    0|    28221|   13.0| null|       S|null| null|Barre, Co Washing...|       0|
|        1083|     3|Olsen, Mr. Henry ...|  male|28.0|    0|    0|   C 4001| 22.525| null|       S|null|173.0|                null|       0|
|         898|     3|Johnson, Mr. Will...|  male|19.0|    0|    0|     LINE|    0.0| null|       S|null| null|                null|       0|
|         560|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|   250648|   13.0| null|       S|  10| null|Finland / Washing...|       1|
|        1079|     3|  Ohman, Miss. Velin|female|22.0|    0|    0|   347085|  7.775| null|       S|   C| null|                null|       1|
|         908|     3|Jussila, Miss. Ma...|female|21.0|    1|    0|     4137|  9.825| null|       S|null| null|                null|       0|
|         313|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|   113503|  211.5|  C82|       C|null| null|     Elkins Park, PA|       0|
|          43|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|    11813|76.2917|  D15|       C|   8| null|    Philadelphia, PA|       1|
|         233|     1|Potter, Mrs. Thom...|female|56.0|    0|    1|    11767|83.1583|  C50|       C|   7| null|Mt Airy, Philadel...|       1|
|         446|     2|"Hocking, Miss. E...|female|20.0|    2|    1|    29105|   23.0| null|       S|   4| null|Cornwall / Akron, OH|       1|
|         602|     3|Abbott, Mr. Rossm...|  male|16.0|    1|    1|C.A. 2673|  20.25| null|       S|null|190.0| East Providence, RI|       0|
|         884|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0|   350047| 7.8542| null|       S|null| null|                null|       0|
|         497|     2|Maybery, Mr. Fran...|  male|40.0|    0|    0|   239059|   16.0| null|       S|null| null|Weston-Super-Mare...|       0|
|        1003|     3|  McCoy, Mr. Bernard|  male|null|    2|    0|   367226|  23.25| null|       Q|  16| null|                null|       1|
|          36|     1|Bowerman, Miss. E...|female|22.0|    0|    1|   113505|   55.0|  E33|       S|   6| null|St Leonards-on-Se...|       1|
|        1088|     3|Olsson, Mr. Oscar...|  male|32.0|    0|    0|   347079|  7.775| null|       S|   A| null|                null|       1|
+------------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----+-----+--------------------+--------+
only showing top 20 rows

In [19]:
type(df)

pyspark.sql.dataframe.DataFrame

In [20]:
df.head(3)

[Row(_c0='passenger_id', _c1='pclass', _c2='name', _c3='sex', _c4='age', _c5='sibsp', _c6='parch', _c7='ticket', _c8='fare', _c9='cabin', _c10='embarked', _c11='boat', _c12='body', _c13='home.dest', _c14='survived'),
 Row(_c0='1216', _c1='3', _c2='Smyth, Miss. Julia', _c3='female', _c4=None, _c5='0', _c6='0', _c7='335432', _c8='7.7333', _c9=None, _c10='Q', _c11='13', _c12=None, _c13=None, _c14='1'),
 Row(_c0='699', _c1='3', _c2='Cacic, Mr. Luka', _c3='male', _c4='38.0', _c5='0', _c6='0', _c7='315089', _c8='8.6625', _c9=None, _c10='S', _c11=None, _c12=None, _c13='Croatia', _c14='0')]

In [21]:
# it will show all datatype of columns simillar to info()
df.printSchema()

root
 |-- _c0: string (nullable = true)
 |-- _c1: string (nullable = true)
 |-- _c2: string (nullable = true)
 |-- _c3: string (nullable = true)
 |-- _c4: string (nullable = true)
 |-- _c5: string (nullable = true)
 |-- _c6: string (nullable = true)
 |-- _c7: string (nullable = true)
 |-- _c8: string (nullable = true)
 |-- _c9: string (nullable = true)
 |-- _c10: string (nullable = true)
 |-- _c11: string (nullable = true)
 |-- _c12: string (nullable = true)
 |-- _c13: string (nullable = true)
 |-- _c14: string (nullable = true)

In [25]:
df = spark.read.option('header', 'true').csv("/Users/komal/Desktop/titanic_train.csv",inferSchema=True)

In [26]:
df.columns

['passenger_id',
 'pclass',
 'name',
 'sex',
 'age',
 'sibsp',
 'parch',
 'ticket',
 'fare',
 'cabin',
 'embarked',
 'boat',
 'body',
 'home.dest',
 'survived']

In [27]:
#to show data using column name
df.select(['name', 'age']).show()

+--------------------+----+
|                name| age|
+--------------------+----+
|  Smyth, Miss. Julia|null|
|     Cacic, Mr. Luka|38.0|
|Van Impe, Mrs. Je...|30.0|
|Hocking, Mrs. Eli...|54.0|
|     Veal, Mr. James|40.0|
|Olsen, Mr. Henry ...|28.0|
|Johnson, Mr. Will...|19.0|
|Sinkkonen, Miss. ...|30.0|
|  Ohman, Miss. Velin|22.0|
|Jussila, Miss. Ma...|21.0|
|Widener, Mr. Harr...|27.0|
|Bucknell, Mrs. Wi...|60.0|
|Potter, Mrs. Thom...|56.0|
|"Hocking, Miss. E...|20.0|
|Abbott, Mr. Rossm...|16.0|
|Jensen, Mr. Niels...|48.0|
|Maybery, Mr. Fran...|40.0|
|  McCoy, Mr. Bernard|null|
|Bowerman, Miss. E...|22.0|
|Olsson, Mr. Oscar...|32.0|
+--------------------+----+
only showing top 20 rows

In [28]:
# use describe() 
# df.describe().show()
df.select(['age']).describe().show()

+-------+------------------+
|summary|               age|
+-------+------------------+
|  count|               676|
|   mean|29.519847189349115|
| stddev|14.562243434125543|
|    min|            0.1667|
|    max|              80.0|
+-------+------------------+

In [ ]:
#drop columns

In [31]:
df = df.drop('passenger_id', 'ticket', 'home.dest' ,'body', 'boat', 'cabin')

In [32]:
df.show()

+------+--------------------+------+----+-----+-----+-------+--------+--------+
|pclass|                name|   sex| age|sibsp|parch|   fare|embarked|survived|
+------+--------------------+------+----+-----+-----+-------+--------+--------+
|     3|  Smyth, Miss. Julia|female|null|    0|    0| 7.7333|       Q|       1|
|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0| 8.6625|       S|       0|
|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|  24.15|       S|       0|
|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3|   23.0|       S|       1|
|     2|     Veal, Mr. James|  male|40.0|    0|    0|   13.0|       S|       0|
|     3|Olsen, Mr. Henry ...|  male|28.0|    0|    0| 22.525|       S|       0|
|     3|Johnson, Mr. Will...|  male|19.0|    0|    0|    0.0|       S|       0|
|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|   13.0|       S|       1|
|     3|  Ohman, Miss. Velin|female|22.0|    0|    0|  7.775|       S|       1|
|     3|Jussila, Miss. Ma...|female|21.0|    1|    0|  9.825|       S|       0|
|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|  211.5|       C|       0|
|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|76.2917|       C|       1|
|     1|Potter, Mrs. Thom...|female|56.0|    0|    1|83.1583|       C|       1|
|     2|"Hocking, Miss. E...|female|20.0|    2|    1|   23.0|       S|       1|
|     3|Abbott, Mr. Rossm...|  male|16.0|    1|    1|  20.25|       S|       0|
|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0| 7.8542|       S|       0|
|     2|Maybery, Mr. Fran...|  male|40.0|    0|    0|   16.0|       S|       0|
|     3|  McCoy, Mr. Bernard|  male|null|    2|    0|  23.25|       Q|       1|
|     1|Bowerman, Miss. E...|female|22.0|    0|    1|   55.0|       S|       1|
|     3|Olsson, Mr. Oscar...|  male|32.0|    0|    0|  7.775|       S|       1|
+------+--------------------+------+----+-----+-----+-------+--------+--------+
only showing top 20 rows

In [72]:
# check if there are any null values in the sum of each column
null_sum = df.agg(*[sum('age') for c in df.columns]).isNull().any()
print(null_sum)

NameError: name 'age' is not defined

In [40]:
#adding columns

In [33]:
# df = df.withColumn('Age after 3 year', df['age']+2).show()
from pyspark.sql.functions import when, isnull

df = df.withColumn('Age after 3 years', when(isnull(df['age']), None).otherwise(df['age']+2))
df.show()

+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|pclass|                name|   sex| age|sibsp|parch|   fare|embarked|survived|Age after 3 years|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|     3|  Smyth, Miss. Julia|female|null|    0|    0| 7.7333|       Q|       1|             null|
|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0| 8.6625|       S|       0|             40.0|
|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|  24.15|       S|       0|             32.0|
|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3|   23.0|       S|       1|             56.0|
|     2|     Veal, Mr. James|  male|40.0|    0|    0|   13.0|       S|       0|             42.0|
|     3|Olsen, Mr. Henry ...|  male|28.0|    0|    0| 22.525|       S|       0|             30.0|
|     3|Johnson, Mr. Will...|  male|19.0|    0|    0|    0.0|       S|       0|             21.0|
|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|   13.0|       S|       1|             32.0|
|     3|  Ohman, Miss. Velin|female|22.0|    0|    0|  7.775|       S|       1|             24.0|
|     3|Jussila, Miss. Ma...|female|21.0|    1|    0|  9.825|       S|       0|             23.0|
|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|  211.5|       C|       0|             29.0|
|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|76.2917|       C|       1|             62.0|
|     1|Potter, Mrs. Thom...|female|56.0|    0|    1|83.1583|       C|       1|             58.0|
|     2|"Hocking, Miss. E...|female|20.0|    2|    1|   23.0|       S|       1|             22.0|
|     3|Abbott, Mr. Rossm...|  male|16.0|    1|    1|  20.25|       S|       0|             18.0|
|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0| 7.8542|       S|       0|             50.0|
|     2|Maybery, Mr. Fran...|  male|40.0|    0|    0|   16.0|       S|       0|             42.0|
|     3|  McCoy, Mr. Bernard|  male|null|    2|    0|  23.25|       Q|       1|             null|
|     1|Bowerman, Miss. E...|female|22.0|    0|    1|   55.0|       S|       1|             24.0|
|     3|Olsson, Mr. Oscar...|  male|32.0|    0|    0|  7.775|       S|       1|             34.0|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
only showing top 20 rows

In [34]:
df

DataFrame[pclass: int, name: string, sex: string, age: double, sibsp: int, parch: int, fare: double, embarked: string, survived: int, Age after 3 years: double]

In [35]:
# Rename the column name
df.withColumnRenamed('name', 'names')

DataFrame[pclass: int, names: string, sex: string, age: double, sibsp: int, parch: int, fare: double, embarked: string, survived: int, Age after 3 years: double]

In [40]:
# this is drop all null rows from dataset
df.na.drop().show()

+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|pclass|                name|   sex| age|sibsp|parch|   fare|embarked|survived|Age after 3 years|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0| 8.6625|       S|       0|             40.0|
|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|  24.15|       S|       0|             32.0|
|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3|   23.0|       S|       1|             56.0|
|     2|     Veal, Mr. James|  male|40.0|    0|    0|   13.0|       S|       0|             42.0|
|     3|Olsen, Mr. Henry ...|  male|28.0|    0|    0| 22.525|       S|       0|             30.0|
|     3|Johnson, Mr. Will...|  male|19.0|    0|    0|    0.0|       S|       0|             21.0|
|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|   13.0|       S|       1|             32.0|
|     3|  Ohman, Miss. Velin|female|22.0|    0|    0|  7.775|       S|       1|             24.0|
|     3|Jussila, Miss. Ma...|female|21.0|    1|    0|  9.825|       S|       0|             23.0|
|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|  211.5|       C|       0|             29.0|
|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|76.2917|       C|       1|             62.0|
|     1|Potter, Mrs. Thom...|female|56.0|    0|    1|83.1583|       C|       1|             58.0|
|     2|"Hocking, Miss. E...|female|20.0|    2|    1|   23.0|       S|       1|             22.0|
|     3|Abbott, Mr. Rossm...|  male|16.0|    1|    1|  20.25|       S|       0|             18.0|
|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0| 7.8542|       S|       0|             50.0|
|     2|Maybery, Mr. Fran...|  male|40.0|    0|    0|   16.0|       S|       0|             42.0|
|     1|Bowerman, Miss. E...|female|22.0|    0|    1|   55.0|       S|       1|             24.0|
|     3|Olsson, Mr. Oscar...|  male|32.0|    0|    0|  7.775|       S|       1|             34.0|
|     3|   Lulic, Mr. Nikola|  male|27.0|    0|    0| 8.6625|       S|       1|             29.0|
|     2|  Herman, Miss. Kate|female|24.0|    1|    2|   65.0|       S|       1|             26.0|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
only showing top 20 rows

In [41]:
# any = how > drop rows who contains null value in every columns
df.na.drop(how="all").show()
# this will drop rows where its finded null value . it is default
#df.na.drop(how="any").show()

+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|pclass|                name|   sex| age|sibsp|parch|   fare|embarked|survived|Age after 3 years|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|     3|  Smyth, Miss. Julia|female|null|    0|    0| 7.7333|       Q|       1|             null|
|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0| 8.6625|       S|       0|             40.0|
|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|  24.15|       S|       0|             32.0|
|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3|   23.0|       S|       1|             56.0|
|     2|     Veal, Mr. James|  male|40.0|    0|    0|   13.0|       S|       0|             42.0|
|     3|Olsen, Mr. Henry ...|  male|28.0|    0|    0| 22.525|       S|       0|             30.0|
|     3|Johnson, Mr. Will...|  male|19.0|    0|    0|    0.0|       S|       0|             21.0|
|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|   13.0|       S|       1|             32.0|
|     3|  Ohman, Miss. Velin|female|22.0|    0|    0|  7.775|       S|       1|             24.0|
|     3|Jussila, Miss. Ma...|female|21.0|    1|    0|  9.825|       S|       0|             23.0|
|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|  211.5|       C|       0|             29.0|
|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|76.2917|       C|       1|             62.0|
|     1|Potter, Mrs. Thom...|female|56.0|    0|    1|83.1583|       C|       1|             58.0|
|     2|"Hocking, Miss. E...|female|20.0|    2|    1|   23.0|       S|       1|             22.0|
|     3|Abbott, Mr. Rossm...|  male|16.0|    1|    1|  20.25|       S|       0|             18.0|
|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0| 7.8542|       S|       0|             50.0|
|     2|Maybery, Mr. Fran...|  male|40.0|    0|    0|   16.0|       S|       0|             42.0|
|     3|  McCoy, Mr. Bernard|  male|null|    2|    0|  23.25|       Q|       1|             null|
|     1|Bowerman, Miss. E...|female|22.0|    0|    1|   55.0|       S|       1|             24.0|
|     3|Olsson, Mr. Oscar...|  male|32.0|    0|    0|  7.775|       S|       1|             34.0|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
only showing top 20 rows

In [42]:
##Threshold -> if you set thresh=2 means rows should contains atleast 2 not null value.
df.na.drop(how="any", thresh=2).show()

+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|pclass|                name|   sex| age|sibsp|parch|   fare|embarked|survived|Age after 3 years|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|     3|  Smyth, Miss. Julia|female|null|    0|    0| 7.7333|       Q|       1|             null|
|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0| 8.6625|       S|       0|             40.0|
|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|  24.15|       S|       0|             32.0|
|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3|   23.0|       S|       1|             56.0|
|     2|     Veal, Mr. James|  male|40.0|    0|    0|   13.0|       S|       0|             42.0|
|     3|Olsen, Mr. Henry ...|  male|28.0|    0|    0| 22.525|       S|       0|             30.0|
|     3|Johnson, Mr. Will...|  male|19.0|    0|    0|    0.0|       S|       0|             21.0|
|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|   13.0|       S|       1|             32.0|
|     3|  Ohman, Miss. Velin|female|22.0|    0|    0|  7.775|       S|       1|             24.0|
|     3|Jussila, Miss. Ma...|female|21.0|    1|    0|  9.825|       S|       0|             23.0|
|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|  211.5|       C|       0|             29.0|
|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|76.2917|       C|       1|             62.0|
|     1|Potter, Mrs. Thom...|female|56.0|    0|    1|83.1583|       C|       1|             58.0|
|     2|"Hocking, Miss. E...|female|20.0|    2|    1|   23.0|       S|       1|             22.0|
|     3|Abbott, Mr. Rossm...|  male|16.0|    1|    1|  20.25|       S|       0|             18.0|
|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0| 7.8542|       S|       0|             50.0|
|     2|Maybery, Mr. Fran...|  male|40.0|    0|    0|   16.0|       S|       0|             42.0|
|     3|  McCoy, Mr. Bernard|  male|null|    2|    0|  23.25|       Q|       1|             null|
|     1|Bowerman, Miss. E...|female|22.0|    0|    1|   55.0|       S|       1|             24.0|
|     3|Olsson, Mr. Oscar...|  male|32.0|    0|    0|  7.775|       S|       1|             34.0|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
only showing top 20 rows

In [43]:
##Subset -> use for specific column which contains null all those rows deleted
df.na.drop(how="any", subset=['age']).show()

+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|pclass|                name|   sex| age|sibsp|parch|   fare|embarked|survived|Age after 3 years|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0| 8.6625|       S|       0|             40.0|
|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|  24.15|       S|       0|             32.0|
|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3|   23.0|       S|       1|             56.0|
|     2|     Veal, Mr. James|  male|40.0|    0|    0|   13.0|       S|       0|             42.0|
|     3|Olsen, Mr. Henry ...|  male|28.0|    0|    0| 22.525|       S|       0|             30.0|
|     3|Johnson, Mr. Will...|  male|19.0|    0|    0|    0.0|       S|       0|             21.0|
|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|   13.0|       S|       1|             32.0|
|     3|  Ohman, Miss. Velin|female|22.0|    0|    0|  7.775|       S|       1|             24.0|
|     3|Jussila, Miss. Ma...|female|21.0|    1|    0|  9.825|       S|       0|             23.0|
|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|  211.5|       C|       0|             29.0|
|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|76.2917|       C|       1|             62.0|
|     1|Potter, Mrs. Thom...|female|56.0|    0|    1|83.1583|       C|       1|             58.0|
|     2|"Hocking, Miss. E...|female|20.0|    2|    1|   23.0|       S|       1|             22.0|
|     3|Abbott, Mr. Rossm...|  male|16.0|    1|    1|  20.25|       S|       0|             18.0|
|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0| 7.8542|       S|       0|             50.0|
|     2|Maybery, Mr. Fran...|  male|40.0|    0|    0|   16.0|       S|       0|             42.0|
|     1|Bowerman, Miss. E...|female|22.0|    0|    1|   55.0|       S|       1|             24.0|
|     3|Olsson, Mr. Oscar...|  male|32.0|    0|    0|  7.775|       S|       1|             34.0|
|     3|   Lulic, Mr. Nikola|  male|27.0|    0|    0| 8.6625|       S|       1|             29.0|
|     2|  Herman, Miss. Kate|female|24.0|    1|    2|   65.0|       S|       1|             26.0|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
only showing top 20 rows

In [54]:
## Filling Missing value
df.na.fill("missing value").show()
# it will replace all null to "missing value"

+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|pclass|                name|   sex| age|sibsp|parch|   fare|embarked|survived|Age after 3 years|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|     3|  Smyth, Miss. Julia|female|null|    0|    0| 7.7333|       Q|       1|             null|
|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0| 8.6625|       S|       0|             40.0|
|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|  24.15|       S|       0|             32.0|
|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3|   23.0|       S|       1|             56.0|
|     2|     Veal, Mr. James|  male|40.0|    0|    0|   13.0|       S|       0|             42.0|
|     3|Olsen, Mr. Henry ...|  male|28.0|    0|    0| 22.525|       S|       0|             30.0|
|     3|Johnson, Mr. Will...|  male|19.0|    0|    0|    0.0|       S|       0|             21.0|
|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|   13.0|       S|       1|             32.0|
|     3|  Ohman, Miss. Velin|female|22.0|    0|    0|  7.775|       S|       1|             24.0|
|     3|Jussila, Miss. Ma...|female|21.0|    1|    0|  9.825|       S|       0|             23.0|
|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|  211.5|       C|       0|             29.0|
|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|76.2917|       C|       1|             62.0|
|     1|Potter, Mrs. Thom...|female|56.0|    0|    1|83.1583|       C|       1|             58.0|
|     2|"Hocking, Miss. E...|female|20.0|    2|    1|   23.0|       S|       1|             22.0|
|     3|Abbott, Mr. Rossm...|  male|16.0|    1|    1|  20.25|       S|       0|             18.0|
|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0| 7.8542|       S|       0|             50.0|
|     2|Maybery, Mr. Fran...|  male|40.0|    0|    0|   16.0|       S|       0|             42.0|
|     3|  McCoy, Mr. Bernard|  male|null|    2|    0|  23.25|       Q|       1|             null|
|     1|Bowerman, Miss. E...|female|22.0|    0|    1|   55.0|       S|       1|             24.0|
|     3|Olsson, Mr. Oscar...|  male|32.0|    0|    0|  7.775|       S|       1|             34.0|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
only showing top 20 rows

In [59]:
## Filling Missing value using subset
# df.na.fill("missing value", 'age').show()
df.na.fill("missing value", ['age', 'sex']).show()

+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|pclass|                name|   sex| age|sibsp|parch|   fare|embarked|survived|Age after 3 years|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|     3|  Smyth, Miss. Julia|female|null|    0|    0| 7.7333|       Q|       1|             null|
|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0| 8.6625|       S|       0|             40.0|
|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|  24.15|       S|       0|             32.0|
|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3|   23.0|       S|       1|             56.0|
|     2|     Veal, Mr. James|  male|40.0|    0|    0|   13.0|       S|       0|             42.0|
|     3|Olsen, Mr. Henry ...|  male|28.0|    0|    0| 22.525|       S|       0|             30.0|
|     3|Johnson, Mr. Will...|  male|19.0|    0|    0|    0.0|       S|       0|             21.0|
|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|   13.0|       S|       1|             32.0|
|     3|  Ohman, Miss. Velin|female|22.0|    0|    0|  7.775|       S|       1|             24.0|
|     3|Jussila, Miss. Ma...|female|21.0|    1|    0|  9.825|       S|       0|             23.0|
|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|  211.5|       C|       0|             29.0|
|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|76.2917|       C|       1|             62.0|
|     1|Potter, Mrs. Thom...|female|56.0|    0|    1|83.1583|       C|       1|             58.0|
|     2|"Hocking, Miss. E...|female|20.0|    2|    1|   23.0|       S|       1|             22.0|
|     3|Abbott, Mr. Rossm...|  male|16.0|    1|    1|  20.25|       S|       0|             18.0|
|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0| 7.8542|       S|       0|             50.0|
|     2|Maybery, Mr. Fran...|  male|40.0|    0|    0|   16.0|       S|       0|             42.0|
|     3|  McCoy, Mr. Bernard|  male|null|    2|    0|  23.25|       Q|       1|             null|
|     1|Bowerman, Miss. E...|female|22.0|    0|    1|   55.0|       S|       1|             24.0|
|     3|Olsson, Mr. Oscar...|  male|32.0|    0|    0|  7.775|       S|       1|             34.0|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
only showing top 20 rows

In [60]:
df.show()

+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|pclass|                name|   sex| age|sibsp|parch|   fare|embarked|survived|Age after 3 years|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
|     3|  Smyth, Miss. Julia|female|null|    0|    0| 7.7333|       Q|       1|             null|
|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0| 8.6625|       S|       0|             40.0|
|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|  24.15|       S|       0|             32.0|
|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3|   23.0|       S|       1|             56.0|
|     2|     Veal, Mr. James|  male|40.0|    0|    0|   13.0|       S|       0|             42.0|
|     3|Olsen, Mr. Henry ...|  male|28.0|    0|    0| 22.525|       S|       0|             30.0|
|     3|Johnson, Mr. Will...|  male|19.0|    0|    0|    0.0|       S|       0|             21.0|
|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|   13.0|       S|       1|             32.0|
|     3|  Ohman, Miss. Velin|female|22.0|    0|    0|  7.775|       S|       1|             24.0|
|     3|Jussila, Miss. Ma...|female|21.0|    1|    0|  9.825|       S|       0|             23.0|
|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|  211.5|       C|       0|             29.0|
|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|76.2917|       C|       1|             62.0|
|     1|Potter, Mrs. Thom...|female|56.0|    0|    1|83.1583|       C|       1|             58.0|
|     2|"Hocking, Miss. E...|female|20.0|    2|    1|   23.0|       S|       1|             22.0|
|     3|Abbott, Mr. Rossm...|  male|16.0|    1|    1|  20.25|       S|       0|             18.0|
|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0| 7.8542|       S|       0|             50.0|
|     2|Maybery, Mr. Fran...|  male|40.0|    0|    0|   16.0|       S|       0|             42.0|
|     3|  McCoy, Mr. Bernard|  male|null|    2|    0|  23.25|       Q|       1|             null|
|     1|Bowerman, Miss. E...|female|22.0|    0|    1|   55.0|       S|       1|             24.0|
|     3|Olsson, Mr. Oscar...|  male|32.0|    0|    0|  7.775|       S|       1|             34.0|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+
only showing top 20 rows

In [61]:
##Filling null value using Mean (Imputer)
from pyspark.ml.feature import Imputer
imputer = Imputer(
inputCols = ['age'],
    outputCols= ["{}_imputed".format(c) for c in ['age']]
).setStrategy("mean")

In [67]:
## Median
imputer = Imputer(
inputCols = ['age'],
    outputCols= ["{}_imputed".format(c) for c in ['age']]
).setStrategy("median")

In [69]:
## Mode
imputer = Imputer(
inputCols = ['age'],
    outputCols= ["{}_imputed".format(c) for c in ['age']]
).setStrategy("mode")

In [70]:
# add imputation cols to df
imputer.fit(df).transform(df).show()

+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+-----------+
|pclass|                name|   sex| age|sibsp|parch|   fare|embarked|survived|Age after 3 years|age_imputed|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+-----------+
|     3|  Smyth, Miss. Julia|female|null|    0|    0| 7.7333|       Q|       1|             null|       18.0|
|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0| 8.6625|       S|       0|             40.0|       38.0|
|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|  24.15|       S|       0|             32.0|       30.0|
|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3|   23.0|       S|       1|             56.0|       54.0|
|     2|     Veal, Mr. James|  male|40.0|    0|    0|   13.0|       S|       0|             42.0|       40.0|
|     3|Olsen, Mr. Henry ...|  male|28.0|    0|    0| 22.525|       S|       0|             30.0|       28.0|
|     3|Johnson, Mr. Will...|  male|19.0|    0|    0|    0.0|       S|       0|             21.0|       19.0|
|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|   13.0|       S|       1|             32.0|       30.0|
|     3|  Ohman, Miss. Velin|female|22.0|    0|    0|  7.775|       S|       1|             24.0|       22.0|
|     3|Jussila, Miss. Ma...|female|21.0|    1|    0|  9.825|       S|       0|             23.0|       21.0|
|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|  211.5|       C|       0|             29.0|       27.0|
|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|76.2917|       C|       1|             62.0|       60.0|
|     1|Potter, Mrs. Thom...|female|56.0|    0|    1|83.1583|       C|       1|             58.0|       56.0|
|     2|"Hocking, Miss. E...|female|20.0|    2|    1|   23.0|       S|       1|             22.0|       20.0|
|     3|Abbott, Mr. Rossm...|  male|16.0|    1|    1|  20.25|       S|       0|             18.0|       16.0|
|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0| 7.8542|       S|       0|             50.0|       48.0|
|     2|Maybery, Mr. Fran...|  male|40.0|    0|    0|   16.0|       S|       0|             42.0|       40.0|
|     3|  McCoy, Mr. Bernard|  male|null|    2|    0|  23.25|       Q|       1|             null|       18.0|
|     1|Bowerman, Miss. E...|female|22.0|    0|    1|   55.0|       S|       1|             24.0|       22.0|
|     3|Olsson, Mr. Oscar...|  male|32.0|    0|    0|  7.775|       S|       1|             34.0|       32.0|
+------+--------------------+------+----+-----+-----+-------+--------+--------+-----------------+-----------+
only showing top 20 rows

In [65]:
#droping column [Age after 3 years]
df.drop("Age after 3 years").show()

+------+--------------------+------+----+-----+-----+-------+--------+--------+
|pclass|                name|   sex| age|sibsp|parch|   fare|embarked|survived|
+------+--------------------+------+----+-----+-----+-------+--------+--------+
|     3|  Smyth, Miss. Julia|female|null|    0|    0| 7.7333|       Q|       1|
|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0| 8.6625|       S|       0|
|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|  24.15|       S|       0|
|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3|   23.0|       S|       1|
|     2|     Veal, Mr. James|  male|40.0|    0|    0|   13.0|       S|       0|
|     3|Olsen, Mr. Henry ...|  male|28.0|    0|    0| 22.525|       S|       0|
|     3|Johnson, Mr. Will...|  male|19.0|    0|    0|    0.0|       S|       0|
|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|   13.0|       S|       1|
|     3|  Ohman, Miss. Velin|female|22.0|    0|    0|  7.775|       S|       1|
|     3|Jussila, Miss. Ma...|female|21.0|    1|    0|  9.825|       S|       0|
|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|  211.5|       C|       0|
|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|76.2917|       C|       1|
|     1|Potter, Mrs. Thom...|female|56.0|    0|    1|83.1583|       C|       1|
|     2|"Hocking, Miss. E...|female|20.0|    2|    1|   23.0|       S|       1|
|     3|Abbott, Mr. Rossm...|  male|16.0|    1|    1|  20.25|       S|       0|
|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0| 7.8542|       S|       0|
|     2|Maybery, Mr. Fran...|  male|40.0|    0|    0|   16.0|       S|       0|
|     3|  McCoy, Mr. Bernard|  male|null|    2|    0|  23.25|       Q|       1|
|     1|Bowerman, Miss. E...|female|22.0|    0|    1|   55.0|       S|       1|
|     3|Olsson, Mr. Oscar...|  male|32.0|    0|    0|  7.775|       S|       1|
+------+--------------------+------+----+-----+-----+-------+--------+--------+
only showing top 20 rows